@extends('frontend.layouts.master')

@section('content_page')
    <main>
        <x-navbar-component  message="سياسة الاستبدال والاسترجاع" />

        <section class="section-container my-5">
            <p class="mb-4">الاستبدال والاسترجاع خلال 30 يوم من تاريخ استلام الطلب على ان يكون المنتج بحالته الاصليه
                والعبوه الاصليه
                ولاكمال عمليه الاسترجاع او الاستبدال لابد من وجود الفاتوره </p>

            <p class="m-0">عند ارجاع المنتج يتم ارجاع جميع متعلقاته سواء هدايا او خصومات منحت بمناسبه شراء هذا المنتج
            </p>
            <p>يسمح للعميل بفتح الشحه وتجربتها امام المندوب وفى حاله عدم اعجاب العميل بالطلب يتم رفض الاستلام ودفع الشحن فقط
            </p>

            <p class="my-4">عند استلام العميل للطلب فى حاله رغبته فى ارجاع المنتج او استبداله لا يتكلف الا مصاريف الشحن
                فقط.</p>

            <h6>حالات لا يتكفل فيها العميل مصاريف الشحن:</h6>
            <p class="m-0">- فى حاله وجود عيوب صناعه واضحه فى المنتج</p>
            <p class="m-0">- فى حاله استبدال المنتج او استرجاعه عند وجود عيب صناعه واضح ظهر بعد الاستخدام قبل مرور شهر من
                تاريخ الاستلام.</p>
        </section>
    </main>
@endsection
